app/controllers/books_controller.rb

  def index
    @books = Book.order('title ASC')
---
SELECT "books".* FROM "books" ORDER BY title ASC

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("title", "author", "genre", "created_at", "updated_at", "published") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", ""], ["author", ""], ["genre", "Fiction"], ["created_at", "2021-02-02 23:25:04.058589"], ["updated_at", "2021-02-02 23:25:04.058589"], ["published", "2021-02-02"]]

  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "title" = $1, "author" = $2, "genre" = $3, "price" = $4, "updated_at" = $5 WHERE "books"."id" = $6  [["title", "Dragon"], ["author", "Dragon Shit"], ["genre", "Mystery"], ["price", 1.5], ["updated_at", "2021-02-02 21:23:11.867767"], ["id", 2]]